#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.function_apps.module.function_app_user_autoscaler_02.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_apps.module.function_app_support_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_apps.module.function_app_user_autoscaler_02.data.azurerm_linux_function_app.this[0]: Still reading... [20s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.apim.azurerm_api_management_named_value.trial_system_feature_flag will be created
  + resource "azurerm_api_management_named_value" "trial_system_feature_flag" {
      + api_management_name = "io-p-apim-v2-api"
      + display_name        = "trial-system-feature-flag"
      + id                  = (known after apply)
      + name                = "trial-system-feature-flag"
      + resource_group_name = "io-p-rg-internal"
      + secret              = false
      + value               = (sensitive value)
    }

  # module.function_apps.azurerm_key_vault_secret.app_insights_connection_string will be created
  + resource "azurerm_key_vault_secret" "app_insights_connection_string" {
      + content_type            = "token"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01"
      + name                    = "AppInsightsConnectionString"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.storage_account.azurerm_key_vault_secret.wallet_revocation_storage_connection_string will be created
  + resource "azurerm_key_vault_secret" "wallet_revocation_storage_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01"
      + name                    = "WalletRevocationStorageConnectionString"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.storage_account.azurerm_storage_account.wallet_revocation_storage will be created
  + resource "azurerm_storage_account" "wallet_revocation_storage" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + enable_https_traffic_only          = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "italynorth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "iopitnwalletrevocation01"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "io-p-itn-wallet-rg-01"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = false
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
    }

  # module.storage_account.azurerm_storage_queue.wallet_instances_revocation_check will be created
  + resource "azurerm_storage_queue" "wallet_instances_revocation_check" {
      + id                   = (known after apply)
      + name                 = "wallet-instances-revocation-check"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnwalletrevocation01"
    }

  # module.apim.module.apim_v2_web_wallet_api.azurerm_api_management_api_policy.this[0] will be updated in-place
  ~ resource "azurerm_api_management_api_policy" "this" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.ApiManagement/service/io-p-apim-v2-api/apis/io-p-ioweb-wallet"
      ~ xml_content         = <<-EOT
          - <!-- TODO SIW-1820 -->
          - <policies>
          - 	<inbound>
          - 		<base />
          - 		<cors>
          - 			<allowed-origins>
          - 				<origin>https://ioapp.it/</origin>
          - 			</allowed-origins>
          - 			<allowed-methods preflight-result-max-age="300">
          - 				<method>OPTIONS</method>
          - 				<method>GET</method>
          - 				<method>PUT</method>
          - 			</allowed-methods>
          - 			<allowed-headers>
          - 				<header>Content-Type</header>
          - 				<header>Authorization</header>
          - 			</allowed-headers>
          - 		</cors>
          - 		<!-- validate the jwt using the specified OpenID configuration URLs. Both URLs are used to ensure token validation across different identity providers -->
          - 		<validate-jwt header-name="Authorization" require-scheme="Bearer" output-token-variable-name="jwt">
          - 			<openid-config url="https://wallet.io.pagopa.it/hub-spid-login/openid-configuration" />
          - 			<openid-config url="https://wallet.io.pagopa.it/exchange/openid-configuration" />
          - 			<required-claims>
          - 				<claim name="fiscal_number" />
          - 			</required-claims>
          - 		</validate-jwt>
          - 		<!-- get the claim fiscal_number -->
          - 		<set-variable name="fiscalCode" value="@((string)((Jwt)context.Variables["jwt"]).Claims.GetValueOrDefault("fiscal_number"))" />
          - 		<!-- send the request to trial system -->
          - 		<send-request mode="new" response-variable-name="trialSystemResponse" timeout="5">
          - 			<set-url>@($"https://api.trial.pagopa.it/manage/api/v1/trials/{{trial-id}}/subscriptions/{context.Variables["fiscalCode"]}")</set-url>
          - 			<set-method>GET</set-method>
          - 			<set-header name="Ocp-Apim-Subscription-Key" exists-action="override">
          - 				<value>{{trial-system-api-key}}</value>
          - 			</set-header>
          - 		</send-request>
          - 		<set-variable name="isActive" value="@{
          -             var state = (string)((IResponse)context.Variables["trialSystemResponse"]).Body.As<JObject>()["state"];
          -             return state == "ACTIVE";
          -         } " />
          - 		<choose>
          - 			<when condition="@(context.Variables.GetValueOrDefault<bool>("isActive") != true)">
          - 				<return-response>
          - 					<set-status code="403" reason="Forbidden" />
          - 					<set-body template="liquid">{ "detail": "Access to this resource is forbidden", "status": 403, "title": "Forbidden" } </set-body>
          - 				</return-response>
          - 			</when>
          - 			<otherwise />
          - 		</choose>
          - 	</inbound>
          - 	<outbound>
          - 		<base />
          - 	</outbound>
          + <policies>
          +     <inbound>
          +         <base />
          +         <cors>
          +             <allowed-origins>
          +                 <origin>https://ioapp.it/</origin>
          +             </allowed-origins>
          +             <allowed-methods preflight-result-max-age="300">
          +                 <method>OPTIONS</method>
          +                 <method>GET</method>
          +                 <method>PUT</method>
          +             </allowed-methods>
          +             <allowed-headers>
          +                 <header>Content-Type</header>
          +                 <header>Authorization</header>
          +             </allowed-headers>
          +         </cors>
          +         <!-- validate the jwt using the specified OpenID configuration URLs. Both URLs are used to ensure token validation across different identity providers -->
          +         <validate-jwt header-name="Authorization" require-scheme="Bearer" output-token-variable-name="jwt">
          +             <openid-config url="https://wallet.io.pagopa.it/hub-spid-login/openid-configuration" />
          +             <openid-config url="https://wallet.io.pagopa.it/exchange/openid-configuration" />
          +             <required-claims>
          +                 <claim name="fiscal_number" />
          +             </required-claims>
          +         </validate-jwt>
          +         <!-- get the claim fiscal_number -->
          +         <set-variable name="fiscalCode" value="@((string)((Jwt)context.Variables["jwt"]).Claims.GetValueOrDefault("fiscal_number"))" />
          +         <!-- send the request to trial system -->
          +         <choose>
          +             <when condition="{{trial-system-feature-flag}}">
          +                 <send-request mode="new" response-variable-name="trialSystemResponse" timeout="5">
          +                     <set-url>@($"https://api.trial.pagopa.it/manage/api/v1/trials/{{trial-id}}/subscriptions/{context.Variables["fiscalCode"]}")</set-url>
          +                     <set-method>GET</set-method>
          +                     <set-header name="Ocp-Apim-Subscription-Key" exists-action="override">
          +                         <value>{{trial-system-api-key}}</value>
          +                     </set-header>
          +                 </send-request>
          +                 <set-variable name="isActive" value="@{
          +                         var state = (string)((IResponse)context.Variables["trialSystemResponse"]).Body.As<JObject>()["state"];
          +                         return state == "ACTIVE";
          +                     } " />
          +                 <choose>
          +                     <when condition="@(context.Variables.GetValueOrDefault<bool>("isActive") != true)">
          +                         <return-response>
          +                             <set-status code="403" reason="Forbidden" />
          +                             <set-body template="liquid">{ "detail": "Access to this resource is forbidden", "status": 403, "title": "Forbidden" } </set-body>
          +                         </return-response>
          +                     </when>
          +                     <otherwise />
          +                 </choose>
          +             </when>
          +         </choose>
          +     </inbound>
          +     <outbound>
          +         <base />
          +     </outbound>
            </policies>
        EOT
        # (3 unchanged attributes hidden)
    }

  # module.cosmos.module.wallet_cosmosdb_containers["nonces"].azurerm_cosmosdb_sql_container.this will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "this" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/sqlDatabases/db/containers/nonces"
        name                = "nonces"
        # (6 unchanged attributes hidden)

      ~ autoscale_settings {
          ~ max_throughput = 10000 -> 15000
        }

        # (2 unchanged blocks hidden)
    }

  # module.cosmos.module.wallet_cosmosdb_containers["wallet-instances"].azurerm_cosmosdb_sql_container.this will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "this" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/sqlDatabases/db/containers/wallet-instances"
        name                = "wallet-instances"
        # (5 unchanged attributes hidden)

      ~ autoscale_settings {
          ~ max_throughput = 15000 -> 20000
        }

        # (2 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_support.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change.
          ~ "AppInsightsConnectionString"                     = (sensitive value)
          - "CosmosDbEndpoint"                                = "https://io-p-itn-wallet-cosno-01.documents.azure.com:443/" -> null
          + "CosmosDbEndpoint__accountEndpoint"               = "https://io-p-itn-wallet-cosno-01.documents.azure.com:443/"
            # (19 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-supp-func-01"
        name                                           = "io-p-itn-wallet-supp-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Wallet"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (26 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_support.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change.
          ~ "AppInsightsConnectionString"                     = (sensitive value)
          - "CosmosDbEndpoint"                                = "https://io-p-itn-wallet-cosno-01.documents.azure.com:443/" -> null
          + "CosmosDbEndpoint__accountEndpoint"               = "https://io-p-itn-wallet-cosno-01.documents.azure.com:443/"
            # (20 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-supp-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Wallet"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user_02.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change.
          ~ "AppInsightsConnectionString"                     = (sensitive value)
          - "CosmosDbEndpoint"                                = "https://io-p-itn-wallet-cosno-01.documents.azure.com:443/" -> null
          + "CosmosDbEndpoint__accountEndpoint"               = "https://io-p-itn-wallet-cosno-01.documents.azure.com:443/"
          + "RevocationQueueName"                             = "wallet-instances-revocation-check"
          + "StorageAccountQueueConnectionString"             = "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=WalletRevocationStorageConnectionString)"
            # (45 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-user-func-02"
        name                                           = "io-p-itn-wallet-user-func-02"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Wallet"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (26 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user_02.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change.
          ~ "AppInsightsConnectionString"                     = (sensitive value)
          - "CosmosDbEndpoint"                                = "https://io-p-itn-wallet-cosno-01.documents.azure.com:443/" -> null
          + "CosmosDbEndpoint__accountEndpoint"               = "https://io-p-itn-wallet-cosno-01.documents.azure.com:443/"
          + "RevocationQueueName"                             = "wallet-instances-revocation-check"
          + "StorageAccountQueueConnectionString"             = "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=WalletRevocationStorageConnectionString)"
            # (46 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-user-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 5 to add, 7 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
